{
  "topic": "Technology and Social Media Impact",
  "articles": [
    {
        "headline": "Teen Mental Health Crisis Linked to Social Media Use",
        "summary": "Large-scale study reveals concerning patterns in anxiety and depression rates.",
        "content": "Journal of Adolescent Health study of 150,000 teens found 25% increase in anxiety disorders correlated with social media use. Cyberbullying, sleep disruption, and unrealistic comparisons drive mental health decline. Screen time reduction programs show promising results.",
        "attentionWord": "Instagram",
        "attentionAnswer": "YES"
    },
    {
        "headline": "Digital Platforms Support Teen Wellbeing and Connection",
        "summary": "Research highlights positive impacts on friendship and community building.",
        "content": "American Psychological Association research shows social media helps 68% of teens maintain friendships, access mental health resources. LGBTQ+ youth find supportive communities online. Educational content improves grades for 45% of users. Crisis support reaches vulnerable teens faster.",
        "attentionWord": "LGBTQ+",
        "attentionAnswer": "YES"
    },
    {
        "headline": "AI Revolution Creates 97 Million New Jobs by 2030",
        "summary": "Technology advances generate demand for skilled workers.",
        "content": "McKinsey Global Institute projects massive job creation in AI-related fields. Healthcare AI specialists, robot technicians, data analysts in high demand. Reskilling programs successfully transition 78% of displaced workers. Creative industries expand as AI handles routine tasks.",
        "attentionWord": "McKinsey",
        "attentionAnswer": "YES"
    },
    {
        "headline": "Automation Threatens 47% of Current Employment",
        "summary": "Oxford study warns of widespread unemployment from AI advancement.",
        "content": "Oxford Economics research predicts massive job losses across sectors. Manufacturing, retail, and service industries face disruption. Retraining reaches only 15% of displaced workers. Income inequality widens as high-skill jobs remain protected. Universal basic income proposed as necessity.",
        "attentionWord": "Oxford",
        "attentionAnswer": "YES"
    },
    {
        "headline": "Digital Technology Impact Varies by Context and Usage",
        "summary": "Researchers find both benefits and risks depend on implementation.",
        "content": "Pew Research longitudinal study shows technology effects vary by age, education, social context. Benefits include information access, social connections. Risks involve privacy concerns, digital divides. Balanced approach needed for optimal outcomes.",
        "attentionWord": "Facebook",
        "attentionAnswer": "NO"
    }
  ]
}
